//class BankAccount
//{
//    int id;
//    string desc;
//    float percent;
//    double money;
//    BankCard card;
//
//};
//class BankCard
//{
//    string date;
//    long long number;
//    short secretnum;
//
//
//};
#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}

//Система управления финансами.
//Система должна иметь следующие возможности :
//-Наличие разных кошельков и карт(дебетовых / кредитных);
//-Пополнение кошельков и карт;
//-Внесение затрат.Каждая затрата относится к определенной категории;
//-Формирование отчетов по затратам и категориям :
//-день;
//-неделя;
//-месяц.
//- Формирование рейтингов по максимальным суммам :
//-ТОП - 3 затрат :
//	-неделя;
//-месяц.
//- ТОП - 3 категорий:
//-неделя;
//-месяц.
//- Сохранение отчетов и рейтингов в файл.